Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxCpu_reg.h
/** \brief C040, CPUx Data Protection Range 8, Lower Bound Register */
#define CPU0_DPR8_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C040u)

/** \brief C044, CPUx Data Protection Range 8, Upper Bound Register */
#define CPU0_DPR8_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C044u)

/** \brief C048, CPUx Data Protection Range 9, Lower Bound Register */
#define CPU0_DPR9_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C048u)

/** \brief C04C, CPUx Data Protection Range 9, Upper Bound Register */
#define CPU0_DPR9_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C04Cu)

/** \brief C050, CPUx Data Protection Range 10, Lower Bound Register */
#define CPU0_DPR10_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C050u)

/** \brief C054, CPUx Data Protection Range 10, Upper Bound Register */
#define CPU0_DPR10_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C054u)

/** \brief C058, CPUx Data Protection Range 11, Lower Bound Register */
#define CPU0_DPR11_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C058u)

/** \brief C05C, CPUx Data Protection Range 11, Upper Bound Register */
#define CPU0_DPR11_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C05Cu)

/** \brief C060, CPUx Data Protection Range 12, Lower Bound Register */
#define CPU0_DPR12_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C060u)

/** \brief C064, CPUx Data Protection Range 12, Upper Bound Register */
#define CPU0_DPR12_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C064u)

/** \brief C068, CPUx Data Protection Range 13, Lower Bound Register */
#define CPU0_DPR13_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C068u)

/** \brief C06C, CPUx Data Protection Range 13, Upper Bound Register */
#define CPU0_DPR13_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C06Cu)

/** \brief C070, CPUx Data Protection Range 14, Lower Bound Register */
#define CPU0_DPR14_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C070u)

/** \brief C074, CPUx Data Protection Range 14, Upper Bound Register */
#define CPU0_DPR14_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C074u)

/** \brief C078, CPUx Data Protection Range 15, Lower Bound Register */
#define CPU0_DPR15_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C078u)

/** \brief C07C, CPUx Data Protection Range 15, Upper Bound Register */
#define CPU0_DPR15_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C07Cu)

/** \brief C080, CPUx Data Protection Range 16, Lower Bound Register */
#define CPU0_DPR16_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C080u)

/** \brief C084, CPUx Data Protection Range 16, Upper Bound Register */
#define CPU0_DPR16_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C084u)

/** \brief C088, CPUx Data Protection Range 17, Lower Bound Register */
#define CPU0_DPR17_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF881C088u)

/** \brief C08C, CPUx Data Protection Range 17, Upper Bound Register */
#define CPU0_DPR17_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF881C08Cu)

/** \brief D000, CPUx Code Protection Range 0 Lower Bound Register */
#define CPU0_CPR0_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF881D000u)

/** \brief D004, CPUx Code Protection Range 0 Upper Bound Register */
#define CPU0_CPR0_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF881D004u)

/** \brief D008, CPUx Code Protection Range 1 Lower Bound Register */
#define CPU0_CPR1_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF881D008u)

/** \brief D00C, CPUx Code Protection Range 1 Upper Bound Register */
#define CPU0_CPR1_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF881D00Cu)

/** \brief D010, CPUx Code Protection Range 2 Lower Bound Register */
#define CPU0_CPR2_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF881D010u)

/** \brief D014, CPUx Code Protection Range 2 Upper Bound Register */
#define CPU0_CPR2_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF881D014u)

/** \brief D018, CPUx Code Protection Range 3 Lower Bound Register */
#define CPU0_CPR3_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF881D018u)

/** \brief D01C, CPUx Code Protection Range 3 Upper Bound Register */
#define CPU0_CPR3_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF881D01Cu)

/** \brief D020, CPUx Code Protection Range 4 Lower Bound Register */
#define CPU0_CPR4_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF881D020u)

/** \brief D024, CPUx Code Protection Range 4 Upper Bound Register */
#define CPU0_CPR4_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF881D024u)

/** \brief D028, CPUx Code Protection Range 5 Lower Bound Register */
#define CPU0_CPR5_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF881D028u)

/** \brief D02C, CPUx Code Protection Range 5 Upper Bound Register */
#define CPU0_CPR5_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF881D02Cu)

/** \brief D030, CPUx Code Protection Range 6 Lower Bound Register */
#define CPU0_CPR6_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF881D030u)

/** \brief D034, CPUx Code Protection Range 6 Upper Bound Register */
#define CPU0_CPR6_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF881D034u)

/** \brief D038, CPUx Code Protection Range 7 Lower Bound Register */
#define CPU0_CPR7_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF881D038u)

/** \brief D03C, CPUx Code Protection Range 7 Upper Bound Register */
#define CPU0_CPR7_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF881D03Cu)

/** \brief D040, CPUx Code Protection Range 8 Lower Bound Register */
#define CPU0_CPR8_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF881D040u)

/** \brief D044, CPUx Code Protection Range 8 Upper Bound Register */
#define CPU0_CPR8_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF881D044u)

/** \brief D048, CPUx Code Protection Range 9 Lower Bound Register */
#define CPU0_CPR9_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF881D048u)

/** \brief D04C, CPUx Code Protection Range 9 Upper Bound Register */
#define CPU0_CPR9_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF881D04Cu)

/** \brief E000, CPUx Code Protection Execute Enable Register Set 0 */
#define CPU0_CPXE_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPXE*)0xF881E000u)

