Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxCpu_reg.h
/** \brief FF04, CPUx Data General Purpose Register 1 */
#define CPU0_D1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF881FF04u)

/** \brief FF08, CPUx Data General Purpose Register 2 */
#define CPU0_D2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF881FF08u)

/** \brief FF0C, CPUx Data General Purpose Register 3 */
#define CPU0_D3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF881FF0Cu)

/** \brief FF10, CPUx Data General Purpose Register 4 */
#define CPU0_D4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF881FF10u)

/** \brief FF14, CPUx Data General Purpose Register 5 */
#define CPU0_D5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF881FF14u)

/** \brief FF18, CPUx Data General Purpose Register 6 */
#define CPU0_D6 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF881FF18u)

/** \brief FF1C, CPUx Data General Purpose Register 7 */
#define CPU0_D7 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF881FF1Cu)

/** \brief FF20, CPUx Data General Purpose Register 8 */
#define CPU0_D8 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF881FF20u)

/** \brief FF24, CPUx Data General Purpose Register 9 */
#define CPU0_D9 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF881FF24u)

/** \brief FF28, CPUx Data General Purpose Register 10 */
#define CPU0_D10 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF881FF28u)

/** \brief FF2C, CPUx Data General Purpose Register 11 */
#define CPU0_D11 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF881FF2Cu)

/** \brief FF30, CPUx Data General Purpose Register 12 */
#define CPU0_D12 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF881FF30u)

/** \brief FF34, CPUx Data General Purpose Register 13 */
#define CPU0_D13 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF881FF34u)

/** \brief FF38, CPUx Data General Purpose Register 14 */
#define CPU0_D14 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF881FF38u)

/** \brief FF3C, CPUx Data General Purpose Register 15 */
#define CPU0_D15 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF881FF3Cu)

/** \brief FF80, CPUx Address General Purpose Register 0 */
#define CPU0_A0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF881FF80u)

/** \brief FF84, CPUx Address General Purpose Register 1 */
#define CPU0_A1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF881FF84u)

/** \brief FF88, CPUx Address General Purpose Register 2 */
#define CPU0_A2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF881FF88u)

/** \brief FF8C, CPUx Address General Purpose Register 3 */
#define CPU0_A3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF881FF8Cu)

/** \brief FF90, CPUx Address General Purpose Register 4 */
#define CPU0_A4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF881FF90u)

/** \brief FF94, CPUx Address General Purpose Register 5 */
#define CPU0_A5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF881FF94u)

/** \brief FF98, CPUx Address General Purpose Register 6 */
#define CPU0_A6 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF881FF98u)

/** \brief FF9C, CPUx Address General Purpose Register 7 */
#define CPU0_A7 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF881FF9Cu)

/** \brief FFA0, CPUx Address General Purpose Register 8 */
#define CPU0_A8 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF881FFA0u)

/** \brief FFA4, CPUx Address General Purpose Register 9 */
#define CPU0_A9 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF881FFA4u)

/** \brief FFA8, CPUx Address General Purpose Register 10 */
#define CPU0_A10 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF881FFA8u)

/** \brief FFAC, CPUx Address General Purpose Register 11 */
#define CPU0_A11 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF881FFACu)

/** \brief FFB0, CPUx Address General Purpose Register 12 */
#define CPU0_A12 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF881FFB0u)

/** \brief FFB4, CPUx Address General Purpose Register 13 */
#define CPU0_A13 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF881FFB4u)

/** \brief FFB8, CPUx Address General Purpose Register 14 */
#define CPU0_A14 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF881FFB8u)

/** \brief FFBC, CPUx Address General Purpose Register 15 */
#define CPU0_A15 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF881FFBCu)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Cpu_Registers_Cfg_Cpu1
 * \{  */
/** \brief 1100, CPUx Flash Configuration Register 0 */
#define CPU1_FLASHCON0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FLASHCON0*)0xF8821100u)

/** \brief 1104, CPUx Flash Configuration Register 1 */
#define CPU1_FLASHCON1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FLASHCON1*)0xF8821104u)

/** \brief 1108, CPUx Flash Configuration Register 2 */
#define CPU1_FLASHCON2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FLASHCON2*)0xF8821108u)

/** \brief 110C, CPUx Flash Configuration Register 3 */
#define CPU1_FLASHCON3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FLASHCON3*)0xF882110Cu)

/** \brief 1110, CPUx Flash Configuration Register 4 */
#define CPU1_FLASHCON4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_FLASHCON4*)0xF8821110u)

/** \brief D000, CPUx  Reset Register 0 */
#define CPU1_KRST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_KRST0*)0xF882D000u)

/** \brief D004, CPUx  Reset Register 1 */
#define CPU1_KRST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_KRST1*)0xF882D004u)

/** \brief D008, CPUx Reset Clear Register */
#define CPU1_KRSTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_KRSTCLR*)0xF882D008u)

/** \brief E000, CPUx Safety Protection SPR Region Lower Address Register 0 */
#define CPU1_RGN0_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_LA*)0xF882E000u)
/** Alias (User Manual Name) for CPU1_RGN0_LA.
* To use register names with standard convension, please use CPU1_RGN0_LA.
*/
#define CPU1_SPR_SPROT_RGNLA0 (CPU1_RGN0_LA)

/** \brief E004, CPUx Safety Protection SPR Region Upper Address Register 0 */
#define CPU1_RGN0_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_UA*)0xF882E004u)
/** Alias (User Manual Name) for CPU1_RGN0_UA.
* To use register names with standard convension, please use CPU1_RGN0_UA.
*/
#define CPU1_SPR_SPROT_RGNUA0 (CPU1_RGN0_UA)

/** \brief E008, CPUx Safety Protection SPR Region Write Access Enable Register A0 */
#define CPU1_RGN0_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENA*)0xF882E008u)
/** Alias (User Manual Name) for CPU1_RGN0_ACCENA.
* To use register names with standard convension, please use CPU1_RGN0_ACCENA.
*/
#define CPU1_SPR_SPROT_RGNACCENA0_W (CPU1_RGN0_ACCENA)

/** \brief E00C, CPUx Safety Protection SPR Region Write Access Enable Register B0 */
#define CPU1_RGN0_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENB*)0xF882E00Cu)
/** Alias (User Manual Name) for CPU1_RGN0_ACCENB.
* To use register names with standard convension, please use CPU1_RGN0_ACCENB.
*/
#define CPU1_SPR_SPROT_RGNACCENB0_W (CPU1_RGN0_ACCENB)

